#### Basic Graph Pattern

Intinya merupakan himpunan triple pattern, sebuah tuple $Q(V, E, L)$.

- $V$ itu $\subseteq$ himpunan node terms

- $L$ itu $\subseteq$ himpunan edge label atau terms
- $E$ itu $\subseteq V\times L \times V$ himpunan edgesnya

![image-20220920081103519](assets/image-20220920081103519.png)

Diberikan sebuah BGP $Q$, yang di atas tadi, definisikan $\text{Var}(Q)$ adalah himpunan semua variabel yang muncul pada $Q$, variabel itu yang ga konstan dan belum dibinding valuenya. Misalkan $\mu: \text{Var} \rightarrow \text{Con}$ , **merupakan sebuah partial mapping**, dari variabel ke konstan pada domainnya si $\mu$, $\text{Con}$ nya bisa berupa $V$ atau $E$ yang penting constant semua isinya.

$\text{dom}(\mu)$: Semua variabel pada mapping $\mu$,

$\mu$ dikatakan solusi terhadap $G$ jika dan hanya jika data graphnya $\mu(Q)$ **merupakan subgraph dari data graph** $G$. $Q(G)$ itu merupakan multiset of solution mapping.
$$
Q(G)=\{\mu \mid \mu(Q) \subseteq G \and \operatorname{dom}(\mu) \subseteq \operatorname{Var}(Q)\}
$$
Bila kita tidak bisa menemukan solution mapping $\mu$, yang merupakan subgraph terhadap query $Q$ nya itu $G$, dan domain dari $\mu$ nya merupakan variabel dari $Q$, artinya semua $\mu$ itu memetakan variabel dari $Q$. Kenapa $\text{dom}(\mu) \subseteq \text{Var}(Q)$, karena tidak semua domainnya perlu kita jawab dan tidak semuanya perlu kita kembalikan semuanya, tapi bisa saja ada query, misalnya kaya

```SPARQL
select ?ev
where {
  ?ev rdf:type ex:FoodFestival ;
  exv:venue ?vn1, ?vn2 .
}
```

Perhatikan bahwa disini yang perlu kita ambil cuma variabel `?ev` nya, tidak perlu $\text{dom}(\mu) = \text{Var}(Q)$. 

Kita katakan data graph $G_1$ itu subgraph dari $G_2$ jika dan hanya jika $V_1 \subseteq V_2, E_1 \subseteq E_2$ dan $L_1 \subseteq L_2$

1. $\mu=\{$ ?ev $\mapsto$ ElD16, ?vn1 $\mapsto$ Piscina Olimpica, ?vn2 $\mapsto$ Sotomayor $\}$
    $\mu(Q)=\{($ EID16, type, Food Festival), (EID16, venue, Priscina Olímpica), (EID16, venue, Sotomayor) $\}$
  - Is $\mu(Q) \subseteq G$ ? **Yes**.
2. $\mu=\{$ ?ev $\mapsto$ ElD16, ?vn1 $\mapsto$ Sotomayor, ?vn2 $\mapsto$ Piscina Olimpica $\}$
    $\mu(Q)=\{($ EID16, type, Food Festival), (EID16, venue, Sotomayor), (EID16, venue, Priscina Olimpica)
  - Is $\mu(Q) \subseteq G$ ? **Yes**.
3. $\mu=\{$ ?ev $\mapsto$ EID16, ?vn1 $\mapsto$ Piscina Olimpica, ?vn2 $\mapsto$ Piscina Olímpica $\}$
    $\mu(Q)=\{($ EID16, type, Food Festival), (EID16, venue, Priscina Olimpica) $\}$
  - Is $\mu(Q) \subseteq G$ ? **Yes**.

Perhatikan bahwa $\mu(Q)$ merupakan set atau himpunan.

Perhatikan bahwa solusi mapping $\mu$ bisa saja $= \empty$, jadi $Q(G) = \{\empty\}$, bisa terjadi saat $\text{Var}(Q) = \empty$, dan ada solusi yang ditemukan. Kalau misalkan tidak ada solution maka $Q(G) = \{\} = \empty$. Bila direcap, menjawab query itu pada dasarnya mengevaluasi BGP pada data graphnya.

#### Blank nodes in Query

Blank nodes dibolehkan pada graph pattern:

- Bisa muncul pada bagian subjek atau objek dari triple (node).
- Diberikan ID tertentu, dan dianggap seperti variabel.
- Seperti variabel, tapi tidak bisa diselect dan diproyeksikan.

Blamk modes bisa muncul pada solusi query atau mapping

- Direpresentasikan dengan entiti yang tidak diketahui.

Perhatikan dua query yang equivalen berikut ini, menggunakan blank nodes. Blank nodes ini bukan literally mengquery blank nodes, tapi jatohnya cuma dummy variable yang ga kepake doang.

```sparql
select ?event ?city where{
	?event rdf:type ?type ;
				 exv:venue ?ven .
	?ven 	 exv:city ?city .
}
```

```sparql
select ?event ?city where{
	?event rdf:type [] ;
				 exv:venue [ exv:city ?city ].
}
```

#### Query involving Literals

Untuk ngematch literal, datatypenya juga harus cocok, bagian yang di dalam tanda petik itu namanya bentuk lexical.

```turtle
@prefix ex: <http://example.org/data/> .
@prefix exv: <http://example.org/vocab#> .

ex:ex1 exv:p "test" .
ex:ex2 exv:p "test"^^xsd:string .
ex:ex3 exv:p "test"@en .
ex:ex4 exv:p "42"^^xsd:integer .
ex:ex5 exv:p 42 .
```

Perhatikan contoh `ex:ex6 exv:p "test"^^xsd:integer` secara syntax ok, tapi graphnya semantiknya unsatisfiable. `"test"` itu bagian lexicalnya, dan `xsd:integer` itu typenya. Semantic wise saat dievaluasi, tidak boleh ada lexical yang tidak cocok dengan data typenya.

```SPARQL
prefix exv: <http://example.org/vocab#> 
SELECT * WHERE {
  ?s exv:p "test" .
}
```

Query di atas bakal ngereturn ex1, ex2 doang, karena yang en itu typenya `rdf:langString`.

```SPARQL
prefix exv: <http://example.org/vocab#> 
SELECT * WHERE {
  ?s exv:p "test"@en .
}
```

Query di atas bakal ngereturn ex3 doang.

```SPARQL
prefix exv: <http://example.org/vocab#> 
SELECT * WHERE {
  ?s exv:p 42 .
}
```

Bakal ngereturn ex4 ex5 juga. Untuk numeric integer, ada syntatic sugarnya, jadi bisa langsung aja ditulis 42 di ex5

#### Select Syntax (Projection)

Ada projection, serupa dengan basis data, itu kita bisa bound dia ke variabel list, atau bisa pake * buat ngeselect all variabel, bisa juga pake DISTINCT buat ngeremove non unique result.

```sparql
prefix exv: <http://example.org/vocab#> 
SELECT DISTINCT ?s ?a WHERE {
  ?s exv:p 42 .
}
```

di sini, `?a` nya bakal kosong di column resultnya.

Ada pula UNION, kita tulisin {$P_1$} UNION {$P_2$}, untuk merepresentasikan dua pola graf, $P_1$ dan $P_2$.

Pada set unionnya itu tetap unique, sementara pada multiset, unionnya simply di plus.

Contoh:

```sparql
PREFIX exv: <http://example.org/vocab#>
PREFIX ex: <http://example.org/>

SELECT ?name ?city WHERE {
  ?event exv:venue ?ven ;
    exv:name ?name .
  {
    ?ven exv:city ex:Santiago .
  } UNION {
    ?ven exv:city ex:Arica .
  }
  ?ven exv:city ?city
}
```

Hasilnya adalah

```
p1 join (p2 union p3) join p4
```

| name           | city                                              |
| -------------- | ------------------------------------------------- |
| Santiago a Mil | [](http://localhost:9999/blazegraph/#explore:kb:) |
| Ñam            | [](http://localhost:9999/blazegraph/#explore:kb:) |
| Food Truck     | [](http://localhost:9999/blazegraph/#explore:kb:) |

Perhatikan juga sifat sifat union:

- Komutatif dan left-asosiatif
- precedencenya setara dengan OPTIONAL
- precedencenya lebih tinggi dari pada conjunction biasa, sehingga bakal diproses duluan, istilahnya kaya perkalian di kalibataku.

Reference: https://www.cs.miami.edu/home/visser/csc751-files/sparql.pdf

Selain itu, ada pula operasi left join, atau yang dikenal dengan optional

- $P_1$ OPTIONAL {$P_2$} artinya dapetin semua solusi mapping buat $P_1$, terus secara opsional join mappingnya dengan $P_2$ kalo ada.
- Kalau solution mapping dari $P_1$ ga bisa dijoin dengan solusi apapun dari $P_2$ tetap dikembaliin dengan ada unbounded variable.

```sparql
SELECT ?name ?start WHERE {
  {
    { ?event rdf:type exv:FoodFestival . }
    UNION
    { ?event rdf:type exv:MusicFestival . }
  	?event exv:name ?name .
  }
  OPTIONAL
  { ?event exv:start ?start . }
}
```

| ?name            | ?start                   |
| ---------------- | ------------------------ |
| Ñam              | 2018-03-22T12:00:00.000Z |
| Food Truck       |                          |
| Santiago a Mil   | 2023-01-09T09:00:00.000Z |
| Festival de Viña |                          |
